In [3]:
#Problem Statement 1:
"""
1) How-to-count-distance-to-the-previous-zero
For each value, count the difference of the distance from the previous zero (or the start of
the Series, whichever is closer) and if there are no previous zeros, print the position
Consider a DataFrame df where there is an integer column {'X'[7, 2, 0, 3, 4, 2, 5, 0, 3, 4]}
The values should therefore be [1, 2, 0, 1, 2, 3, 4, 0, 1, 2]. Make this a new column 'Y'.
import pandas as pd
df = pd.DataFrame({'X': [7, 2, 0, 3, 4, 2, 5, 0, 3, 4]})
"""

import pandas as pd
df = pd.DataFrame({'X': [7, 2, 0, 3, 4, 2, 5, 0, 3, 4]}) 
def distZero(list1):
    list2 = []
    pos = 0
    for i,n in enumerate(list1):
    
        if (n==0):
            pos=0
        else:
            pos+=1
        list2.append(pos)
    return list2
df["Y"]=distZero(df["X"])
print (df)

   X  Y
0  7  1
1  2  2
2  0  0
3  3  1
4  4  2
5  2  3
6  5  4
7  0  0
8  3  1
9  4  2

In [37]:
"""
2) Create a DatetimeIndex that contains each business day of 2015 and use it to index a
Series of random numbers.
3) Find the sum of the values in s for every Wednesday
4) Average For each calendar month


"""
import numpy as np
date_range = pd.date_range(start='2015-01-01',end='2015-12-31',freq='d')

df_series= pd.Series(np.random.randint(0,100,365),index=date_range)

#Find the sum of the values in s for every Wednesday
print ("sum of the values in series for every Wednesday is ",df_series.loc[df_series.index.day_name()=='Wednesday'].sum())

#Average For each calendar month
df_series_grp_ny_month = df_series.groupby(by=[df_series.index.month])

print ("Avg of each calender month ")
print(df_series_grp_ny_month.mean())
print (df_series.resample('M').mean())

sum of the values in series for every Wednesday is  2505
Avg of each calender month
1     42.935484
2     33.607143
3     37.419355
4     51.466667
5     52.903226
6     52.533333
7     53.096774
8     49.580645
9     47.800000
10    32.129032
11    46.333333
12    48.032258
dtype: float64
2015-01-31    42.935484
2015-02-28    33.607143
2015-03-31    37.419355
2015-04-30    51.466667
2015-05-31    52.903226
2015-06-30    52.533333
2015-07-31    53.096774
2015-08-31    49.580645
2015-09-30    47.800000
2015-10-31    32.129032
2015-11-30    46.333333
2015-12-31    48.032258
Freq: M, dtype: float64

2015-01-01    99
2015-05-01    98
2015-09-01    99
Freq: 4MS, dtype: int32

In [106]:
"""5) For each group of four consecutive calendar months in s, find the date on which the highest
value occurred."""

df_group_four = df_series.resample('4MS')
#print (df_group_four.groups)
for g in df_group_four.groups:
    #print (df_group_four.get_group(g))
    #print (df_group_four.get_group(g))
    
    print ("Max no of in group  {} is {} ".format(g,df_group_four.get_group(g).max()))
    print ("Here are the dates")
    print (df_group_four.get_group(g).loc[df_group_four.get_group(g)==df_group_four.get_group(g).max()])

"""
Problem 1 Done
"""

Max no of in group  2015-01-01 00:00:00 is 99
Here are the dates
2015-04-29    99
Freq: D, dtype: int32
Max no of in group  2015-05-01 00:00:00 is 98
Here are the dates
2015-05-12    98
2015-07-19    98
2015-08-03    98
dtype: int32
Max no of in group  2015-09-01 00:00:00 is 99
Here are the dates
2015-09-26    99
2015-12-18    99
Freq: 83D, dtype: int32

'\nProblem 1 Done\n'

dtype('<M8[ns]')

In [107]:
"""

Problem Statement 2:
Read the dataset from the below link
https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Nam
es_right.csv
Questions:
1) Delete unnamed columns
2) Show the distribution of male and female

3) Show the top 5 most preferred names
4) What is the median name occurrence in the dataset
5) Distribution of male and female born count by states

"""

import pandas as pd

path=r"https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv"
df =pd.read_csv(path)

In [113]:
print (df.head())

###1) Delete unnamed columns
df_new = df.drop(df.columns[df.columns.str.contains('unnamed',case = False)],axis=1)

print()
print ()
print ("After deleteing the un named columns")
print (df_new.head(5))

   Unnamed: 0     Id     Name  Year Gender State  Count
0       11349  11350     Emma  2004      F    AK     62
1       11350  11351  Madison  2004      F    AK     48
2       11351  11352   Hannah  2004      F    AK     46
3       11352  11353    Grace  2004      F    AK     44
4       11353  11354    Emily  2004      F    AK     41


After deleteing the un named columns
      Id     Name  Year Gender State  Count
0  11350     Emma  2004      F    AK     62
1  11351  Madison  2004      F    AK     48
2  11352   Hannah  2004      F    AK     46
3  11353    Grace  2004      F    AK     44
4  11354    Emily  2004      F    AK     41

In [115]:
### 2) Show the distribution of male and female

df_grouped = df_new.groupby("Gender")
df_grouped.describe()

              Id                                                              \
           count          mean           std      min         25%        50%
Gender
F       558846.0  2.793178e+06  1.658818e+06  11350.0  1242540.25  2807898.5
M       457549.0  2.877176e+06  1.643518e+06  24077.0  1325498.00  2867541.0

                                   Year               ...                  \
               75%        max     count         mean  ...     75%     max
Gender                                                ...
F       4333051.75  5634124.0  558846.0  2009.026258  ...  2012.0  2014.0
M       4241792.00  5647426.0  457549.0  2009.086085  ...  2012.0  2014.0

           Count
           count       mean         std  min  25%   50%   75%     max
Gender
F       558846.0  29.310925   75.962992  5.0  6.0  10.0  23.0  3634.0
M       457549.0  41.615650  118.074308  5.0  7.0  12.0  29.0  4167.0

[2 rows x 24 columns]

In [117]:
###3) Show the top 5 most preferred names

df_name_count=df_new['Name'].value_counts()
print (df_name_count.head(5))

Riley     1112
Avery     1080
Jordan    1073
Peyton    1064
Hayden    1049
Name: Name, dtype: int64

In [141]:
###4) What is the median name occurrence in the dataset
df_name_count.median()

8.0

In [147]:
#5) Distribution of male and female born count by states
df_group_by_sex= df_new.groupby(by = ["State","Gender"])
df_group_by_sex.count()['Id']

State  Gender
AK     F          2404
       M          2587
AL     F          9878
       M          8419
AR     F          7171
       M          6475
AZ     F         14518
       M         10820
CA     F         45144
       M         31637
CO     F         11424
       M          9183
CT     F          6575
       M          5733
DC     F          3053
       M          3000
DE     F          2549
       M          2440
FL     F         25781
       M         20070
GA     F         19385
       M         15454
HI     F          3255
       M          3546
IA     F          7131
       M          6307
ID     F          4918
       M          4833
IL     F         21268
       M         16828
                 ...
OK     F          9519
       M          8138
OR     F          8604
       M          7333
PA     F         17480
       M         14171
RI     F          2558
       M          2468
SC     F          9465
       M          8195
SD     F          2838
       M          2908
TN     F         13063
       M         10588
TX     F         39760
       M         27791
UT     F          9515
       M          8233
VA     F         14759
       M         11997
VT     F          1398
       M          1618
WA     F         13329
       M         11049
WI     F         10549
       M          8940
WV     F          4305
       M          3733
WY     F          1456
       M          1904
Name: Id, Length: 102, dtype: int64

In [ ]:
"""
Assignement 7 complete
"""